dazui0019/gd32l233_ws2812/Drivers/fm175xx/fm175xx_reg.h
/*********************************************************************
*                                                                    *
*   Copyright (c) 2010 Shanghai FuDan MicroElectronic Inc, Ltd.      *
*   All rights reserved. Licensed Software Material.                 *
*                                                                    *
*   Unauthorized use, duplication, or distribution is strictly       *
*   prohibited by law.                                               *
*                                                                    *
**********************************************************************/
#ifndef _FM175XX_REG_H
#define _FM175XX_REG_H

#define  JREG_PAGE0           0x00    //Page register in page 0
#define  JREG_COMMAND         0x01    //Contains Command bits, PowerDown bit and bit to switch receiver off.
#define  JREG_COMMIEN         0x02    //Contains Communication interrupt enable bits andbit for Interrupt inversion.
#define  JREG_DIVIEN          0x03    //Contains RfOn, RfOff, CRC and Mode Interrupt enable and bit to switch Interrupt pin to PushPull mode.
#define  JREG_COMMIRQ         0x04    //Contains Communication interrupt request bits.
#define  JREG_DIVIRQ          0x05    //Contains RfOn, RfOff, CRC and Mode Interrupt request.
#define  JREG_ERROR           0x06    //Contains Protocol, Parity, CRC, Collision, Buffer overflow, Temperature and RF error flags.
#define  JREG_STATUS1         0x07    //Contains status information about Lo- and HiAlert, RF-field on, Timer, Interrupt request and CRC status.
#define  JREG_STATUS2         0x08    //Contains information about internal states (Modemstate),Mifare states and possibility to switch Temperature sensor off.
#define  JREG_FIFODATA        0x09    //Gives access to FIFO. Writing to register increments theFIFO level (register 0x0A), reading decrements it.
#define  JREG_FIFOLEVEL       0x0A    //Contains the actual level of the FIFO.     
#define  JREG_WATERLEVEL      0x0B    //Contains the Waterlevel value for the FIFO 
#define  JREG_CONTROL         0x0C    //Contains information about last received bits, Initiator mode bit, bit to copy NFCID to FIFO and to Start and stopthe Timer unit.
#define  JREG_BITFRAMING      0x0D    //Contains information of last bits to send, to align received bits in FIFO and activate sending in Transceive*/
#define  JREG_COLL            0x0E    //Contains all necessary bits for Collission handling 
#define  JREG_RFU0F           0x0F    //Currently not used.                                 
                               
                               
#define  JREG_PAGE1           0x10    //Page register in page 1
#define  JREG_MODE            0x11    //Contains bits for auto wait on Rf, to detect SYNC byte in NFC mode and MSB first for CRC calculation
#define  JREG_TXMODE          0x12    //Contains Transmit Framing, Speed, CRC enable, bit for inverse mode and TXMix bit.                            
#define  JREG_RXMODE          0x13    //Contains Transmit Framing, Speed, CRC enable, bit for multiple receive and to filter errors.                 
#define  JREG_TXCONTROL       0x14    //Contains bits to activate and configure Tx1 and Tx2 and bit to activate 100% modulation.                      
#define  JREG_TXAUTO          0x15    //Contains bits to automatically switch on/off the Rf and to do the collission avoidance and the initial rf-on.
#define  JREG_TXSEL           0x16    //Contains SigoutSel, DriverSel and LoadModSel bits.
#define  JREG_RXSEL           0x17    //Contains UartSel and RxWait bits.                 
#define  JREG_RXTRESHOLD      0x18    //Contains MinLevel and CollLevel for detection.    
#define  JREG_DEMOD           0x19    //Contains bits for time constants, hysteresis and IQ demodulator settings. 
#define  JREG_FELICANFC       0x1A    //Contains bits for minimum FeliCa length received and for FeliCa syncronisation length.
#define  JREG_FELICANFC2      0x1B    //Contains bits for maximum FeliCa length received.      
#define  JREG_MIFARE          0x1C    //Contains Miller settings, TxWait settings and MIFARE halted mode bit.
#define  JREG_MANUALRCV       0x1D    //Currently not used.                          
#define  JREG_TYPEB           0x1E    //Contains bits for TYPE B SOF, EOF and EGT settings.                         
#define  JREG_SERIALSPEED     0x1F    //Contains speed settings for serila interface.
                               
                               
#define  JREG_PAGE2           0x20    //Page register in page 2 
#define  JREG_CRCRESULT1      0x21    //Contains MSByte of CRC Result.                
#define  JREG_CRCRESULT2      0x22    //Contains LSByte of CRC Result.                
#define  JREG_GSNLOADMOD      0x23    //Contains the conductance and the modulation settings for the N-MOS transistor only for load modulation (See difference to JREG_GSN!). 
#define  JREG_MODWIDTH        0x24    //Contains modulation width setting.                    
#define  JREG_TXBITPHASE      0x25    //Contains TxBitphase settings and receive clock change.
#define  JREG_RFCFG           0x26    //Contains sensitivity of Rf Level detector, the receiver gain factor and the RfLevelAmp.
#define  JREG_GSN             0x27    //Contains the conductance and the modulation settings for the N-MOS transistor during active modulation (no load modulation setting!).
#define  JREG_CWGSP           0x28    //Contains the conductance for the P-Mos transistor.    
#define  JREG_MODGSP          0x29    //Contains the modulation index for the PMos transistor.
#define  JREG_TMODE           0x2A    //Contains all settings for the timer and the highest 4 bits of the prescaler.
#define  JREG_TPRESCALER      0x2B    //Contais the lowest byte of the prescaler.   
#define  JREG_TRELOADHI       0x2C    //Contains the high byte of the reload value. 
#define  JREG_TRELOADLO       0x2D    //Contains the low byte of the reload value.  
#define  JREG_TCOUNTERVALHI   0x2E    //Contains the high byte of the counter value.
#define  JREG_TCOUNTERVALLO   0x2F    //Contains the low byte of the counter value. 
                               
                               
#define  JREG_PAGE3           0x30    //Page register in page 3
#define  JREG_TESTSEL1        0x31    //Test register                              
#define  JREG_TESTSEL2        0x32    //Test register                              
#define  JREG_TESTPINEN       0x33    //Test register                              
#define  JREG_TESTPINVALUE    0x34    //Test register                              
#define  JREG_TESTBUS         0x35    //Test register                              
#define  JREG_AUTOTEST        0x36    //Test register                              
#define  JREG_VERSION         0x37    //Contains the product number and the version .
#define  JREG_ANALOGTEST      0x38    //Test register                              
#define  JREG_TESTDAC1        0x39    //Test register                              
#define  JREG_TESTDAC2        0x3A    //Test register                              
#define  JREG_TESTADC         0x3B    //Test register                              
#define  JREG_ANALOGUETEST1   0x3C    //Test register                              
#define  JREG_ANALOGUETEST0   0x3D    //Test register                              
#define  JREG_ANALOGUETPD_A   0x3E    //Test register                              
#define  JREG_ANALOGUETPD_B   0x3F    //Test register                              


#define  CMD_MASK          0xF0

#define     CMD_IDLE          0x00
#define     CMD_CONFIGURE     0x01 
#define     CMD_GEN_RAND_ID   0x02
#define     CMD_CALC_CRC      0x03 
#define     CMD_TRANSMIT      0x04 
#define     CMD_NOCMDCHANGE   0x07 
#define     CMD_RECEIVE       0x08 
#define     CMD_TRANSCEIVE    0x0C 
#define     CMD_AUTOCOLL      0x0D
#define     CMD_AUTHENT       0x0E 
#define     CMD_SOFT_RESET    0x0F 


/* /////////////////////////////////////////////////////////////////////////////
 * Bit Definitions
 * ////////////////////////////////////////////////////////////////////////// */
/*name FM175XX Bit definitions of Page 0 */
/* Command Register							(01) */
#define     JBIT_RCVOFF             0x20   /*Switches the receiver on/off. */
#define     JBIT_POWERDOWN          0x10   /*Switches FM175XX to Power Down mode. */

/* CommIEn Register							(02) */
#define     JBIT_IRQINV             0x80   /*Inverts the output of IRQ Pin. */

/* DivIEn Register							(03) */
#define     JBIT_IRQPUSHPULL        0x80   /*Sets the IRQ pin to Push Pull mode. */

/* CommIEn and CommIrq Register         (02, 04) */
#define     JBIT_TXI                0x40   /*Bit position for Transmit Interrupt Enable/Request.*/
#define     JBIT_RXI                0x20   /*Bit position for Receive Interrupt Enable/Request. */
#define     JBIT_IDLEI              0x10   /*Bit position for Idle Interrupt Enable/Request.    */
#define     JBIT_HIALERTI           0x08   /*Bit position for HiAlert Interrupt Enable/Request. */
#define     JBIT_LOALERTI           0x04   /*Bit position for LoAlert Interrupt Enable/Request. */
#define     JBIT_ERRI               0x02   /*Bit position for Error Interrupt Enable/Request.   */
#define     JBIT_TIMERI             0x01   /*Bit position for Timer Interrupt Enable/Request.   */

/* DivIEn and DivIrq Register           (03, 05) */
#define     JBIT_SIGINACT           0x10   /*Bit position for SiginAct Interrupt Enable/Request. */
#define     JBIT_MODEI              0x08   /*Bit position for Mode Interrupt Enable/Request. */
#define     JBIT_CRCI               0x04   /*Bit position for CRC Interrupt Enable/Request. */
#define     JBIT_RFONI              0x02   /*Bit position for RF On Interrupt Enable/Request. */
#define     JBIT_RFOFFI             0x01   /*Bit position for RF Off Interrupt Enable/Request. */

/* CommIrq and DivIrq Register          (04, 05) */
#define     JBIT_SET                0x80   /*Bit position to set/clear dedicated IRQ bits. */

